
Процедура ОбработкаПроведения(Отказ, Режим)
	Если СтатусЗаказа = Перечисления.СтатусЗаказа.Принят Тогда 
		Движения.СредстваНаСкладе.Записывать = Истина;
		Движения.СредстваНаСкладе.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураСостав.Комплектующие КАК Комплектующие,
		|	СУММА(НоменклатураСостав.Количество) КАК Количество,
		|	СУММА(ЗаказыУслуги.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_ТЧДока
		|ИЗ
		|	Документ.Заказы.Услуги КАК ЗаказыУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Состав КАК НоменклатураСостав
		|		ПО ЗаказыУслуги.Услуга = НоменклатураСостав.Ссылка
		|ГДЕ
		|	ЗаказыУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НоменклатураСостав.Комплектующие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧДока.Комплектующие КАК Комплектующие,
		|	ВТ_ТЧДока.Количество КАК КоличествоВДоке,
		|	ВТ_ТЧДока.Цена КАК ЦенаВДоке,
		|	СредстваНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	СредстваНаСкладеОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	ВТ_ТЧДока КАК ВТ_ТЧДока
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СредстваНаСкладе.Остатки(
		|				&Дата,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_ТЧДока.Комплектующие КАК Номенклатура
		|					ИЗ
		|						ВТ_ТЧДока КАК ВТ_ТЧДока)) КАК СредстваНаСкладеОстатки
		|		ПО ВТ_ТЧДока.Комплектующие = СредстваНаСкладеОстатки.Номенклатура";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка= РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Недостаток = Выборка.КоличествоВДоке - Выборка.КоличествоОстаток;
			
			Если Недостаток>0 Тогда 
				Сообщить("Номенклатуры "+Выборка.Номенклатура+" в количестве "+Недостаток);
				Отказ = Истина
			КонецЕсли;        
			
			Движения.СредстваНаСкладе.Записывать = Истина;
			Движение = Движения.СредстваНаСкладе.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Количество = Выборка.КоличествоВДоке;
			Движение.Сумма = Выборка.КоличествоВДоке/Выборка.КоличествоОстаток*Выборка.СуммаОстаток;
			
		КонецЦикла; 
	КонецЕсли;
	
	// регистр ЗанятостьСотрудников
	Движения.ЗанятостьСотрудников.Записывать = Истина;
	Движение = Движения.ЗанятостьСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = ФИОСотрудника;
	Движение.Занятость = СтатусСотрудника;

	// регистр ВзятыеЗаказы 
	Движения.ВзятыеЗаказы.Записывать = Истина;
	Движение = Движения.ВзятыеЗаказы.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = ФИОСотрудника;
	Движение.СтоимостьЗаказов = ОбщаяСтоимость;
	
	Если НЕ СтатусЗаказа <> Перечисления.СтатусЗаказа.Принят Тогда 
		Набор = РегистрыСведений.СтатусыСозданияЗаказов.СоздатьНаборЗаписей();
		Запись = Набор.Добавить();
		Запись.ChatId = ЧатИД;
		Запись.ЗаказСоздается = Ложь;
		Набор.Записать(Истина); 
	КонецЕсли;                  
	Если СтатусЗаказа = Перечисления.СтатусЗаказа.Принят Тогда
		SDK_Telegram.sendMessage(ЧатИД,"Ваш заказ №"+Номер+" принят");
	КонецЕсли;
	
	Если СтатусЗаказа = Перечисления.СтатусЗаказа.Выполнен Тогда
		SDK_Telegram.sendMessage(ЧатИД,"Ваш заказ №"+Номер+" выполнен");
	КонецЕсли;
КонецПроцедуры
