
Функция ОбновитьЗаказы()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Ссылка,
		|	Заказы.ФИОЗаказчика КАК ФИОЗаказчика,
		|	Заказы.Адрес КАК Адрес,
		|	Заказы.СтатусЗаказа КАК СтатусЗаказа,
		|	Заказы.ПлощадьПомещения КАК ПлощадьПомещения,
		|	Заказы.ФИОСотрудника КАК ФИОСотрудника,
		|	Заказы.ВремяОкончанияЗаказа КАК ВремяОкончанияЗаказа,
		|	Заказы.СтатусСотрудника КАК СтатусСотрудника,
		|	Заказы.Номер КАК Номер
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.Заказы КАК Заказы
		|ГДЕ
		|	Заказы.ПометкаУдаления = &Ложь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Ссылка КАК Ссылка,
		|	ВременнаяТаблица.ФИОЗаказчика КАК ФИОЗаказчика,
		|	ВременнаяТаблица.Адрес КАК Адрес,
		|	ВременнаяТаблица.СтатусЗаказа КАК СтатусЗаказа,
		|	ВременнаяТаблица.ПлощадьПомещения КАК ПлощадьПомещения,
		|	ВременнаяТаблица.ФИОСотрудника КАК ФИОСотрудника,
		|	ВременнаяТаблица.ВремяОкончанияЗаказа КАК ВремяОкончанияЗаказа,
		|	ВременнаяТаблица.СтатусСотрудника КАК СтатусСотрудника,
		|	ЗаказыУслуги.Услуга КАК Услуга,
		|	ЗаказыУслуги.Цена КАК Цена,
		|	ВременнаяТаблица.Номер КАК Номер
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказы.Услуги КАК ЗаказыУслуги
		|		ПО ВременнаяТаблица.Ссылка = ЗаказыУслуги.Ссылка
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ложь", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ТаблДоки = Новый ТаблицаЗначений;
	
	ТаблДоки.Колонки.Добавить("Ссылка");
	ТаблДоки.Колонки.Добавить("Номер");
	ТаблДоки.Колонки.Добавить("ФИОЗаказчика");
	ТаблДоки.Колонки.Добавить("Адрес");
	ТаблДоки.Колонки.Добавить("СтатусЗаказа");
	ТаблДоки.Колонки.Добавить("ПлощадьПомещения");
	ТаблДоки.Колонки.Добавить("ФИОСотрудника");
	ТаблДоки.Колонки.Добавить("ВремяОкончанияЗаказа");
	ТаблДоки.Колонки.Добавить("СтатусСотрудника");
	
	Пока ВыборкаСсылка.Следующий() Цикл
		Док =  ТаблДоки.Добавить();
		Док.Ссылка = XMLСтрока(ВыборкаСсылка.Ссылка);
		
		ТаблицаДока = Новый ТаблицаЗначений;
		
		ТаблицаДока.Колонки.Добавить("Услуга");
		ТаблицаДока.Колонки.Добавить("УслугаГуид");
		ТаблицаДока.Колонки.Добавить("Цена");
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Док.Номер					= ВыборкаДетальныеЗаписи.номер;
			Док.ФИОЗаказчика			= ВыборкаДетальныеЗаписи.ФИОЗаказчика;
			Док.Адрес					= ВыборкаДетальныеЗаписи.Адрес;
			Док.СтатусЗаказа			= ВыборкаДетальныеЗаписи.СтатусЗаказа;
			Док.ПлощадьПомещения		= ВыборкаДетальныеЗаписи.ПлощадьПомещения; 
			Док.ФИОСотрудника			= ВыборкаДетальныеЗаписи.ФИОСотрудника;
			Док.ВремяОкончанияЗаказа	= ВыборкаДетальныеЗаписи.ВремяОкончанияЗаказа;
			Док.СтатусСотрудника		= ВыборкаДетальныеЗаписи.СтатусСотрудника;
			
			СтрДока = ТаблицаДока.Добавить();
			СтрДока.Услуга 		= ВыборкаДетальныеЗаписи.Услуга;
			СтрДока.УслугаГуид	= XMLСтрока(ВыборкаДетальныеЗаписи.Услуга);
			СтрДока.Цена		= ВыборкаДетальныеЗаписи.Цена;
			
		КонецЦикла;
		Док.Таблица =  ТаблицаДока;
	КонецЦикла;
	Возврат Новый ХранилищеЗначения(ТаблДоки);
КонецФункции
