Функция РозничнаяЦена(АктуальнаяДата, ЭлементНоменклатуры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Цены.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены КАК Цены
		|ГДЕ
		|	Цены.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", ЭлементНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		 Возврат ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
   	 
КонецФункции    

Функция ОпределениеСтатусаСотрудника(АктуальнаяДата ,КакойНитьЭлемент) Экспорт
	Отбор = Новый Структура("Статус", КакойНитьЭлемент);
	ЗначениеРесурсов = РегистрыСведений.ЗанятостьСотрудников.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат  ЗначениеРесурсов.Занятость;
КонецФункции
