
&НаКлиенте
Процедура ПапкакСохраненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.Каталог = " " ;
	Диалог.Заголовок = "Выберите каталог ";
	
	Если Диалог.Выбрать() Тогда
		ПапкакСохранения = Диалог.Каталог+"\";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьEXCEl(Команда)  
	Если ПапкакСохранения = ""  тогда  
		Возврат;
	КонецЕсли;

	//Для уникальности имени файла добавим к его имени дату и время создания
	ДатаВремя = СтрЗаменить(ТекущаяДата(),":",".");
	ИмяФайла = "Выгрузка_"+ДатаВремя;
	//Добавим выбранный каталог к к именя файла 
	ПолноеИмяФайла = ПапкакСохранения+ИмяФайла+".xls";
	
	//Создадим табличный документ
	ТабДок = Новый ТабличныйДокумент;
	
	//Создадим файл эксель: Запишем нашу вновь созданную таблицу в файл 
	ТабДок.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	
	//Заполним таблицу на сервере
	ТабДок = КнопкаСформироватьНаСервере(ТабДок);
	
	//Запишем заполненную таблицу в этот же файл
	ТабДок.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	

КонецПроцедуры   
//&НаСервере
//Процедура ЗаполнитьТаблицуНаСервере(ТабДок)
//		
//	
//КонецПроцедуры
&НаСервере
Функция КнопкаСформироватьНаСервере(ТабДок)
	////Прочитаем наш отчет на сервере, чтобы стали доступны процедуры из модуля объект этого отчета
	//Документ = РеквизитФормыВЗначение("Отчет");
	////Вызовем нашу процедуру заполнения
	//Документ.ЗаполнитьТаблицуНаСервере(ТабДок);
	
	Запрос = Новый Запрос;  
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыУслуги.Ссылка КАК Ссылка,
		|	ЗаказыУслуги.НомерСтроки КАК НомерСтроки,
		|	ЗаказыУслуги.Услуга КАК Услуга,
		|	ЗаказыУслуги.Цена КАК Цена
		|ИЗ
		|	Документ.Заказы.Услуги КАК ЗаказыУслуги";
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(РезультатЗапроса);       
	Построитель.Вывести(ТабДок);
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		//ТабДок.Вывести(ОбластьСтрока);
	//КонецЦикла;
	
Возврат ТабДок;	
КонецФункции
